11/data/attachments/cd986360e385ba7c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cccdb5a6-ee86-4345-91c9-d1cf209bb9ab</nif:username>
            <nif:friendToBeAdded>Heather_hard_Friend_52211_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>